NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_application.svd
        <register>
          <name>DAINTMSK</name>
          <description>Device All Endpoints Interrupt Mask Register</description>
          <addressOffset>0x81C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INEPMSK0</name>
              <description>IN Endpoint 0 Interrupt mask Bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint 0 Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK1</name>
              <description>IN Endpoint 1 Interrupt mask Bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK2</name>
              <description>IN Endpoint 2 Interrupt mask Bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK3</name>
              <description>IN Endpoint 3 Interrupt mask Bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK4</name>
              <description>IN Endpoint 4 Interrupt mask Bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK5</name>
              <description>IN Endpoint 5 Interrupt mask Bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK6</name>
              <description>IN Endpoint 6 Interrupt mask Bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK7</name>
              <description>IN Endpoint 7 Interrupt mask Bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK8</name>
              <description>IN Endpoint 8 Interrupt mask Bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK9</name>
              <description>IN Endpoint 9 Interrupt mask Bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK10</name>
              <description>IN Endpoint 10 Interrupt mask Bit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK11</name>
              <description>IN Endpoint 11 Interrupt mask Bit</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK12</name>
              <description>IN Endpoint 12 Interrupt mask Bit</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK13</name>
              <description>IN Endpoint 13 Interrupt mask Bit</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK14</name>
              <description>IN Endpoint 14 Interrupt mask Bit</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INEPMSK15</name>
              <description>IN Endpoint 15 Interrupt mask Bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask IN Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK0</name>
              <description>OUT Endpoint 0 Interrupt mask Bit</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint 0 Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK1</name>
              <description>OUT Endpoint 1 Interrupt mask Bit</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK2</name>
              <description>OUT Endpoint 2 Interrupt mask Bit</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK3</name>
              <description>OUT Endpoint 3 Interrupt mask Bit</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK4</name>
              <description>OUT Endpoint 4 Interrupt mask Bit</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK5</name>
              <description>OUT Endpoint 5 Interrupt mask Bit</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK6</name>
              <description>OUT Endpoint 6 Interrupt mask Bit</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK7</name>
              <description>OUT Endpoint 7 Interrupt mask Bit</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK8</name>
              <description>OUT Endpoint 8 Interrupt mask Bit</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK9</name>
              <description>OUT Endpoint 9 Interrupt mask Bit</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK10</name>
              <description>OUT Endpoint 10 Interrupt mask Bit</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK11</name>
              <description>OUT Endpoint 11 Interrupt mask Bit</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK12</name>
              <description>OUT Endpoint 12 Interrupt mask Bit</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK13</name>
              <description>OUT Endpoint 13 Interrupt mask Bit</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK14</name>
              <description>OUT Endpoint 14 Interrupt mask Bit</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEPMSK15</name>
              <description>OUT Endpoint 15 Interrupt mask Bit</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Mask OUT Endpoint Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>No Interrupt mask</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DVBUSDIS</name>
          <description>Device VBUS Discharge Time Register</description>
          <addressOffset>0x828</addressOffset>
          <access>read-write</access>
          <resetValue>0x000017D7</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DVBUSDIS</name>
              <description>Device VBUS Discharge Time (DVBUSDis)</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DVBUSPULSE</name>
          <description>Device VBUS Pulsing Time Register</description>
          <addressOffset>0x82C</addressOffset>
          <access>read-write</access>
          <resetValue>0x000005B8</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DVBUSPULSE</name>
              <description>Device VBUS Pulsing Time (DVBUSPulse)</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
